let booksName = [
    "001 വിനയം തീർത്ത കർമ വിസ്മയം",
    "002 അബൂഉബൈദ (റ)",
    "003 ബീവി ആസിയ (റ)",
    "004 നഫീസത്തുൽ മിസ്‌രിയ്യ: (റ)",
    "005 സാറാ ബീവിയും ഹാജറാ ബീവിയും",
    "006 അജ്മീർ ഖാജാ (റ)",
    "007 പ്രവാചക പത്നിമാർ",
    "008 നന്മയുടെ ഉമ്മ റാബിഅത്തുൽ അദവിയ്യ:",
    "009 ഹസ്റത് ആഇശ;  നൂറ് കഥകൾ",
    "010 ഉമ്മു കുൽസൂം (റ)",
    "011 അംറ്ബ്നുൽ ആസ് (റ)",
    "012 മൗലവി കാടേരി മുഹ് അബുൽ കമാൽ",
    "013 ഇമാം അഹ്മദുബ്നു ഹമ്പൽ (റ)",
    "014 വെളിയംകോട് ഉമർ ഖാളി (റ)",
    "015 മൗലാനാ അബ്ദുറഹ്മാൻ ഫദ്ഫരി കുട്ടി മുസ്ലിയാർ",
    "016 സ്വഹാബികൾ ചരിത്ര ക്വിസ്",
    "017 ഇസ്ലാമിക ഭരണം",
    "018 അറിവ് തണലൊരുക്കിയ കാലം",
    "019 ചരിത്രങ്ങളും കറാമത്തുകളും",
    "020 പാങ്ങിൽ അഹ്മദ് കുട്ടി മുജീയാർ",
    "021 മഹാന്മാരുടെ മഹനീയ ജീവിതം",
    "022 നൂർ",
    "023 അല്ലഫൽ അലിഫ്",
    "024 ദാവൂദും താബൂത്തും",
    "025 മർയമിന്റെ മകൻ",
    "026 മരണത്തിന്റെ താഴ്വരകൾ",
    "027 ഹുദ് ഹുദ് പറഞ്ഞ കഥ",
    "028 സിനായുടെ സന്ദേശം",
    "029 തീ കടൽ കടന്ന ത്യാഗം",
    "030 നീനവായിലെ വെളിച്ചം",
    "031 സ്വർഗത്തിലെ ഒട്ടകം",
    "032 മുന്നു നക്ഷത്രങ്ങൾ",
    "033 പിതാവും പുത്രന്മാരും",
    "034 തഅ്ലീമുൽ മുഅല്ലിം",
    "035 അബ്ബാസിയ ഭരണം",
    "036 നരഗത്തിലെ വിശേഷണങ്ങൾ",
    "037 ഖത്വീബിന്റെ ഡയറി",
    "038 സൽമാനുൽ ഫാരിസി (റ) ചരിത്രം",
    "039 മരണാനുബന്ധ മുറകൾ",
    "040 ഇമാം സുയൂഥി (റ)",
    "041 ഇമാം അബൂ ഹനീഫ (റ)",
    "042 പ്രഭാത ജീവിതവും അന്ത്യപ്രഭാഷണവും",
    "043 മരുഭൂവിലെ മഞ്ഞുതുള്ളി",
    "044 മിഹ്റാബിലെ കന്യക",
    "045 ഉമ്മു ഐമൻ (റ)",
    "046 സകാതും നോമ്പും",
    "047 നാഗൂർ സുൽത്വാൻ",
    "048 അൽഭുത വ്യക്തിത്വങ്ങൾ",
    "049 101 സൂഫി കഥകൾ",
    "050 ഇമാം ബുഖാരി",
    "051 മുഹമ്മദ് നബി (സ) ജീവിതം സമ്പൂർണ്ണം",
    "052 islamic Quiz വിശുദ്ധ ഖുർആൻ",
    "053 ഇസ്‌ലാമിലെ സാമൂഹ്യ പരിഷ്കർത്താക്കൾ",
    "054 സമസ്ത ക്വിസ്",
    "055 സുന്നി ആദർശം ചോദ്യോത്തരങ്ങളിലൂടെ (1)",
    "056 സുന്നി ആദർശം ചോദ്യോത്തരങ്ങളിലൂടെ (2)",
    "057 മദ്ഹബിന്റെ അനിവാര്യത",
    "058 വചന പൊരുൾ. സംസ്കരണത്തിന്റെ നബി മെഴികൾ",
    "059 പുത്തൻപള്ളി ശൈഖ്  കുഞ്ഞഹമ്മദ് മുസ്ലിയാർ",
    "060 എൻ്റെ നബി",
    "061 അലിവ് പെയ്യും ശൗര്യം",
    "062 ഇമാം മാലിക് (റ)",
    "063 ജാഫർ ബിനു അബി തോൽവി",
    "064 ജലാലുദ്ദീൻ ഭൂമി",
    "065 മുഹാദ്ബ്നു ജബൽ (റ) കഥകൾ",
    "066 റാബിഅബസ്റി ദിവ്യനുരാഗത്തിന്റെ വിശുദ്ധ പക്ഷി",
    "067 ഫാഷിസ വഴിയും വർത്തമാനവും",
    "068 ഇമ്പ മേകും കൂട്ട്",
    "069 ഡോ.ബി.ആർ അംബേദ്ക്കർ",
    "070 മൗലാന അബുസ്സബാഹ്  അഹ്മദ് അലി",
    "071 ഖാഇദെമില്ലത്ത്",
    "072 ടി. ഉബൈദ്",
    "073 ബീ.വി അബ്ദുള്ള കോയ",
    "074 നൂരിഷാ ത്വരീഖത്ത്",
    "075 സമസ്തയും കീഘടകങ്ങളും",
    "076 മുജാഹിദ് പ്രസ്ഥാനം എങ്ങോട്ട്",
    "077 ഒരിക്കൽ കൂടി",
    "078 കെ.കെ ഹസ്റത്ത് ജീവിതവും ദർശനവും",
    "079 ഇസ് ലുഹു അഹമ്മദ്",
    "080 ഗുരുവിൻ്റെ തണലിൽ ന്നാലു പതിറ്റാണ്ട്",
    "081 എൻ.വി.അബ്ദുസ്സലാം മൗലവി",
    "082 കെ.ടി ഉസ്താദ് വഴിയൊരുക്കിയ യുഗപുരുഷൻ",
    "083 അജജും ഉംറയും സിയാറത്തും",
    "084 മലയമ്മ അബൂബക്കർ മുസ്ലിയാർ",
    "085 ഇബ്രാഹിം ഇബ്നു അദ്ഹം",
    "086 ഷംസുൽ ഉലമയും ഔലിയാക്കളും",
    "087 പാഴ്സി മുഹമ്മദ് ജീവിതം സൗഹൃദം കല",
    "088 ഖുർആനിലെ അമൂല്യരത്നങ്ങൾ",
    "089 ഉമർഖാസി(റ)",
    "090 മഹീളാ മുത്തുകൾ",
    "091 ഉമ്മയും മകനും",
    "092 ഖലീഫാ ഉമറ് (റ) 100കഥകൾ",
    "093 മമ്പുറം തങ്ങൾ ജീവിതം ആത്മീയത പോരാട്ടം",
    "094 ഖസ്വസുൽ ഔലിയാഹ് (1)",
    "095 നിസാമുദ്ദീൻ ഔലിയ നിലാവെളിച്ചം",
    "096 സീതി സാഹിബ് സ്മാരകഗ്രന്ഥം",
    "097 ഉസ്മാൻ ബ്നു അഫ്ഫാൻ(റ)",
    "098 കിറ്റി എട്ടു ഗുണപാഠ കഥകൾ",
    "099 100 ഹദീസ് കഥകൾ",
    "100 ഹംസയുടെ കൊലയാളി",
    "101 ഒരു കർമ്മം നിരവധി നിയ്യത്തുകൾ",
    "102 മയ്യത്ത് പരിപാലന ക്രമങ്ങൾ",
    "103 ശൈഖ് ശംസുദ്ധീൻ",
    "104 മതവും രാഷ്ട്രീയവും ഇന്ത്യയിൽ",
    "105 വഹ്ശിയുടെ വിലാപങ്ങൾ",
    "106 തെബ് ലീഗ് ജമാഹത്ത്",
    "107 സൂറത്തു നൂർ",
    "108 തജ് വീദ് നിയമങ്ങൾ ഒരു ലഘൂകരണം",
    "109 അഹലു ബൈത്തിന്റെ  മാർഗം",
    "110 ടിപ്പുസുൽത്താന്റെ ചരിത്രത്തിൽ എങ്ങനെ അനഭിമതനായി",
    "111 സഊദി പണ്ഡിതരോട് ഒരു ഉപദേശം",
    "112 പ്രതിഭാശാലികൾ",
    "113 അതുല്യരായ മഹാരഥന്മാർ",
    "114 സുന്നത്ത് നിസ്കാരങ്ങൾ",
    "115 വഖ്ഫ്: ചിത്രവും സ്വാധീനവും",
    "116 സ്ത്രീദനം",
    "117 സഹദ് ബ്നു അബീ വഖാസ്",
    "118 ത്വൽഹത്ത് ബ്നു ഉബൈദില്ല(റ)",
    "119 ഉമറുൽ ഫാറൂഖ്(റ)",
    "120 അബ്ദു റഹ്മാൻ ബ്നു ഔഫ്(റ)",
    "121 അലിയ്യ് ബ്നു അബീത്വാലിബ്(റ)",
    "122 അബൂ ബക്കർ സിദ്ധീഖ്(റ)",
    "123 സഈദ് ബ്നു സൈഹദ്",
    "124 രണ്ടാം ശാഫിഈ ഇമാം നഹ് വി ഇമാം(റ)",
    "125 സുബൈറുബ് നുൽ അവ്വാം(റ)",
    "126 ഇബ്റാഹിം ബ്നു അദ്ഹം",
    "127 നിസ്ക്കാര സംശയ നിവരണം",
    "128 നോഹയുടെ വെട്ടകം",
    "129 മുസ്ലിമിൻ്റെ വിജയത്തിൽ തഹജ്ജുദ് നിസ്‌കാരം",
    "130 വെള്ളി നക്ഷത്രം",
    "131 ബഹാത്ത് ബുആദ്",
    "132 പ്രവാചകൻറെ അത്ഭുത കഥകൾ",
    "133 ആനയും അമ്പാരിയും",
    "134 സഹനത്തിന്റെ പൂമരം",
    "135 ആദ്യ പിതാവ്",
    "136 സ്ത്രീകൾക്കും മൗലികാവകാശങ്ങൾ ഉണ്ട്",
    "137 നിങ്ങൾക്കും എഴുത്തുകാരാകാം",
    "138 സ്ത്രി നിലവിളികൾ പ്രതിവിതികൾ",
    "139 സ്ത്രീ വീടിന്റെ വിളിക്ക്",
    "140 എൻ്റെ ഹിറ്റ്ലർ",
    "141 നവോഥാനത്തിലെ വിമാനങ്ങൾ",
    "142 സ്ത്രീകൾ മായം അറിയാൻ",
    "143 ഖുർആനിലെ സ്ത്രീ സാന്നിധ്യം",
    "144 നുണയാം നുകരാം ജീവിത മധുരം",
    "145 ഹിന്ദ്",
    "146 ശുജായി മൊയ്‌തു മുസ്ലിയർ ധിഷണ സമരം",
    "147 വിവാഹം സംശയനിവാരണം",
    "148 രക്തപുഷ്‌പങ്ങൾ",
    "149 കൗമാരത്തിനൊരു സ്നേഹസന്ദേശം",
    "150 സ്ത്രീധനം",
    "151 ഹിജാബ് സഹോദരിമാരോട് സ്നേഹപൂർവം",
    "152 കൊടുക്കാനുള്ള കോഴി",
    "153 ആൻഫ്രാങ്ക്",
    "154 സ്റ്റീഫൻ ഹോക്കിങ്ങ് ജീവിക്കുന്ന ഒരു ഇതിഹാസം",
    "155 ലിംഗസമത്വം എന്ന മിഥ്യ",
    "156 സ്റ്റീവ് ജോബ്സ്",
    "157 ഇംഗ്ലീഷ്-ഇംഗ്ലീഷ്-മലയാളം നിഘണ്ടു",
    "158 അൽ-മൻഹൽ അറബി-മലയാളം നിഘണ്ടു"
];





let authorNames = [
    "ഡോ. മോയിൻ ഹുദവി മലയമ്മ",
    "മുഹമ്മദ് ഹുദവി കാപ്പ്",
    "മോയിൻ മലയമ്മ",
    "മോയിൻ ഹുദവി മലയമ്മ",
    "എ. വി. എം. റഷീദ് ഫൈസി",
    "പി.ടി അബ്ദുൽ അസീസ്",
    "ഡോ. അബ്ദുർറഹ്മാൻ മൗലവി  ഒളവട്ടൂർ",
    "കെ എച്ച്, കോട്ടപ്പുഴ",
    "സഈദ് മുത്തനൂർ",
    "മുജീബ് റഹ്മാൻ കാക്കാട്",
    "മുഹമ്മദ് ടി എച്ച് ദാരിമി",
    "ഡോ. കെ.എം. ബഹാഉദ്ദീൻ ഹുദവി",
    "പ്രൊഫ: കൊടുവള്ളി അബ്ദുൽ ഖാദിർ",
    "ഷമീർ മഹ്ളരി നെടിയനാട്",
    "മുഹമ്മദ് ജാബിർ അലി ഹുദവി",
    "അബുൽ ബുഷ്റ",
    "പി മുഹമ്മദ് മുണ്ടംപറമ്പ്",
    "ചെറുശ്ശേരി ഉസ്താദ്",
    "കെ കെ അബ്ദുറഹിമാൻ മുസ്ലിയാർ",
    "സി.പി ബാസിത്ത് ഹുദവി തിരുർ.",
    "ഡോ സലാം ഓമശ്ശേരി",
    "അക്ബർ എസ്. അഹ്മദ്",
    "സി.ഹംസ",
    "മുഹമ്മദ് ഹുദവി കാപ്പ്",
    "ഗിഫു മേലാറ്റൂർ",
    "ഇ.ടി ഹുസൈൻ ഹുദവി",
    "ശാഫി ഹുറവി വേങ്ങര",
    "പി.കെ മുഹമ്മദ് ശരീഫ് ഹുദവി",
    "എം. അബ്ബാസ്",
    "ഇർഷാന അയ്യനാരി",
    "യൂനുസ് ഹുദവി ചെമ്മാട്",
    "സി മുഹമ്മദ് ഹുദവി ഒഴുക്കുർ",
    "സിദ്ധീഖ് നദ്വി ചേരൂർ",
    "എം എം ജലീൽ സഖാഫി പുല്ലാര",
    "ഖുബൈബ് തൊട്ടിക്കൽ",
    "റിയാസ് ഫൈസി വെള്ളില",
    "സാദിഖ് അവരി",
    "ഒഴുകൂർ വി.പി ഷൗകത്ത്",
    "എൻ വി മുഹമ്മദ് ബാഖവി മേൽമുറി",
    "എപി മുഹമ്മദ് ഇസ്മാഈൽ ഹുദവി ചെമ്മലശ്ശേരി",
    "സി മുഹമ്മദ് ഹുദവി",
    "കെ എ അബ്ദുല്ല",
    "മർയം ജുമാന സഹ്റവിയ",
    "മുർഷിദ് ഹുദവി മോളൂർ",
    "പ്രൊഫ കൊടുവള്ളി അബ്ദുൽ ഖാദിർ",
    "എൻ വി മുഹമ്മദ് ബാഖവി മേൽമുറി",
    "റിയാസ് ഫൈസി വെള്ളില",
    "ഡോ സഈദ് റമളാൽ അൽ ബുത്വി",
    "ബാലയിൽ ജലീൽ ഹുദവി",
    "കെ എ കെ ഫൈസി കോട്ടപ്പുറം",
    "മുഹമ്മദ് റഈസ്. കെടി",
    "ഫാറുഖ് ഹുദവി.തരിശ്",
    "ഇസ്ലാമിക് സാഹിത്യ അക്കാദമി.",
    "ശാഹിദ് വെളിയാമ്പ്ര",
    "എം.എ ജലീൽ സഖാഫി പുല്ലാര",
    "എം.എ ജലീൽ സഖാഫി പുല്ലാര",
    "ശൈഖ് മുഹമ്മദ് അൽ ഹാമിദ്",
    "അൻവർ ഹുദവി അലി. പുളിയക്കോട്",
    "അബൂബക്കർ കോടങ്ങാട്",
    "പി.കെ മുഹമ്മദ് ശരീഫ് ഹുദവി",
    "ടി.പി ചെറുപ്പ",
    "സയ്യിദ് സലാഹുദ്ധീൻ ബുഖാരി കൂരിയാട്",
    "സി. മുഹമ്മദ് ഉദവി ഓമശ്ശേരി",
    "പ്രൊഫൈൽ കൊടുവള്ളി അബ്ദുൽ ഖാദിർ",
    "ബാലൻ നായർ",
    "പി മുഹമ്മദ് കുട്ടശ്ശേരി",
    "എ.കെ രിഫാഇ",
    "കെ. അബൂബക്കർ",
    "കെ. അബൂബക്കർ",
    "മോയ്‌തു മുസ്ലിയാർ",
    "മോഹിനുദവി മലയമ്മ",
    "സിദ്ദീഖ് മുഹമ്മദ്",
    "ഡോ. ശംസുൽ ഇസ്ലാം",
    "സിറാജുദ്ദീൻ പറമ്പത്ത്",
    "ഡോ. ശംസുൽ ഇസ്ലാം",
    "അൽ ഫുർഖാനി",
    "ശരീഷ് ഉദവി കാരിമുക്ക്",
    "വിശയൻ കുന്നുമക്കര",
    "ശൈഖ് സയ്യിദ് യൂസ്ഫ് ഹാഷിം റിഫാഇ",
    "ഡോ.കെ.കെ രാഹുലൻ",
    "റിയാസ് ഫൈസി വെള്ളിലെ",
    "കുരുക്കൾ പീടിക്കൽ അഹമ്മദ് മുസ്ലിയാർ",
    "മുഹമ്മദ് ഉഗ്രപുരം",
    "വി.കെ അബ്ദുൽ വാണിമ്മേൽ",
    "ലയ്യിന വഫിയ്യ അമ്പലകടവ്",
    "സൈഫുദ്ധീൻ വാഫി അരിക്കോട്",
    "മുർഷിദ് ഹുദവി മേളൂർ",
    "ഇഖ്ബാൽ ഉദവി ഏലംകുളം",
    "വലിയേറ .പി",
    "അലിഹുസൈൻ ഹുദവി അബലകണ്ടി",
    "ശമീർ മഹ്ളരി നെടിയനാട്",
    "സലീം ഹുദവി ഇരിങ്ങാട്ടൂർ",
    "കുഞ്ഞുമുഹമ്മദ് പാണ്ടികശാല",
    "എൻ. പി മുഹമ്മ് ബാഖവി മേൽമുറി",
    "ഹനീഫ് ഹെമ നി പനങ്ങാങ്ങര",
    "ബലം ഓമശ്ശേരി",
    "ഗിഫു മേലാറ്റൂർ",
    "മൗലവി മാഹീൻ അബൂബക്കർ MFD",
    "അലിയേവി. വി",
    "മുഹമ്മദ് ഹുദവി കാപ്പ്",
    "സി.പി. ശരീഫ് ഹുദവി പുതുപ്പറമ്പ്",
    "മജീദ് ഹുദവി പുതു പ്പറമ്പ്",
    "ചേറ്റൂർ അബ്ദുള്ള മുസ്ലിയാർ",
    "ജൂലിയ കാമ്പ്റ്റർട്ടൻ",
    "സൈനുദ്ധീൻ ഇർഫാൻ മാണൂർ",
    "സയ്യിദ് അബീബുല്ല സഅദി കൊന്നാര്",
    "പോൾ ജോസഫ് ഗീബൽസ്",
    "ഒരുസംഘം ലേഖകൾ",
    "സയ്യിദ് അലാവുദീൻ ബുഖാരി",
    "ടി. വി. എം. ഊർക്കടവ്",
    "സിറാജുദ്ദീൻ പറമ്പത്ത്",
    "കുടുവള്ളി അബ്‌ദുൽ ഖാദിർ",
    "ഡോ. പി സക്കീർ ഹുസൈൻ",
    "ഡോ. പി സക്കീർ ഹുസൈൻ",
    "എൻ. വി-മുഹമ്മദ് ബാഖവി",
    "മുഹമ്മദ് പാറന്നൂർ",
    "സിറാജുദ്ദീൻ പറമ്പത്ത്",
    "അബ്ദുല്ല മുസലിയാർ ചേറൂർ",
    "ഡോ. സഈദ് റമദാൻ അൽ ബ്യൂഥി",
    "എം.എൻ.വിജയൻ സ്‌മരണകൾ",
    "സത്യൻ കല്ലുരുട്ടി",
    "ഡോ. പി സേതുമാധവൻ",
    "സിദ്ദീഖ് നദ്‌വി ചേരൂർ",
    "ലിജിത്ത് പി ദാസ് ശ്രീജ നായർ",
    "Dr G. B. Mohan Thampi",
    "എഡിറ്റർ. അബ്‌ദുറഹിമാൻ ആദ്യശ്ശേരി"
];

 let limit = booksName.length;
console.log(authorNames);

console.log(limit);

function createDiv(i){
    let main = document.getElementsByTagName('main')[0];
    let div1 = document.createElement('div');
    div1.className = "book";
    
    let div2 = document.createElement('div');
    div2.className = "number";
    let h4 = document.createElement('h4');
    h4.innerHTML = i+1;
    div2.appendChild(h4);
    div1.appendChild(div2);
    
    let div3 = document.createElement('div');
    div3.className = "title";
    if (i+1 < 10) {
        div3.id = `00${i+1}`;
    } else if (i+1 < 100) {
        div3.id = `0${i+1}`;
    } else {
        div3.id = `${i+1}`;
    }
    
    let book = booksName[i].slice(3);
    div3.innerHTML = book;
    div1.appendChild(div3);
    main.appendChild(div1);
}

for (let i = 0; i < limit; i++) {
    createDiv(i);
}

const resultBox = document.querySelector(".result-box");
const inputBox = document.getElementById("input-box");

inputBox.onkeyup = function(){
    let result = [];
    let input = inputBox.value;
    if (input.length) {
        result = booksName.filter((keyword) => {
            return keyword.includes(input);
        });
    }
    display(result);
    if (!result.length) {
        resultBox.innerHTML = '';
    }
}

function display(result) {
    const input = inputBox.value;
    const content = result.map((list) => {
        let newList = '';
        let i = 0;
        while (i < list.length) {
            let found = false;
            if (i + input.length <= list.length && list.substring(i, i + input.length) === input) {
                newList += `<span class="highlight">${input}</span>`;
                i += input.length;
                found = true;
            }
            if (!found) {
                newList += list[i];
                i++;
            }
        }
        let bookId = list.slice(0, 3);
        let destinationId = bookId -5;
        if(destinationId < 4){
            destinationId = "head";
        }else if(destinationId < 10) {
            destinationId = `00${destinationId}`;
        } else if (i+1 < 100) {
            destinationId = `0${destinationId}`;
        } else {
            destinationId = `${destinationId}`;
        }
        return `<li onclick="selectInput('${bookId}')"><a href="#${destinationId}">${newList}</a></li>`;
    });
    resultBox.innerHTML = "<ul>" + content.join('') + "</ul>";
}

function selectInput(bookId) {
    let titleDiv = document.getElementById(bookId);
    let numDiv = titleDiv.previousElementSibling;
    // numDiv.className = 'blinking-slow';
    // titleDiv.className = 'blinking-slow';
    let parentElement = titleDiv.parentElement;
    parentElement.classList.add('blinking-slow');
    setTimeout(function(){
        parentElement.classList.remove('blinking-slow');
        // numDiv.classList.remove('blinking-slow');
        // titleDiv.classList.remove('blinking-slow');
    },5000);
    inputBox.value = titleDiv.textContent;
    resultBox.innerHTML = '';
}


//databade

